Revit 2027 API
BoundaryConditions.Preset Property
 The boundary conditions preset.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundaryConditionsPreset Preset { get; set; }
Public Property Preset As BoundaryConditionsPreset
	Get
	Set
public:
property BoundaryConditionsPreset Preset {
	BoundaryConditionsPreset get ();
	void set (BoundaryConditionsPreset value);
}
member Preset : BoundaryConditionsPreset with get, set
Property Value
BoundaryConditionsPreset
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The provided BoundaryConditionsPreset preset is not supported for this boundary conditions type.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace